project8/p1/app/views/photos/index.html.erb


	<% @user.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos"  WHERE "photos"."user_id" = ?  [["user_id", 1]]

					<img src="<%= asset_path(photo.file_name) %>" alt="<%=@user.first_name%>'s photo"/>
					<% photo.tags.each do |tag| %>
                    	<div class="tagName" id="tagName_<%= tag.id.to_s %>" style="left: <%= tag.x_pos-10 %>px; top: <%= tag.y_pos-17 %>px; display: none;">                    	<%= tag.user.first_name+" "+tag.user.last_name%>
---
SELECT "tags".* FROM "tags"  WHERE "tags"."photo_id" = ?  [["photo_id", 6]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]


	        <% photo.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."photo_id" = ?  [["photo_id", 4]]