project7/app/controllers/photos_controller.rb

    def index
        if params[:id] and User.exists?(params[:id])
            @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  	def create
  		puts "photo create---------"
  		@photo = Photo.new(photo_params(params[:photo]))
  		@photo.user_id = session[:user]
  		@photo.file_name = params[:photo][:file].original_filename
  		@photo.date_time = DateTime.now
  		if @photo.save()
---
INSERT INTO "photos" ("date_time", "file_name", "user_id") VALUES (?, ?, ?)  [["date_time", "2015-02-12 23:21:50.236949"], ["file_name", "material_design_1.jpg"], ["user_id", 1]]