project5/app/controllers/comments_controller.rb

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]
---
    def new
        if Photo.exists?(:id => params[:id])
            puts "photo exists"
            @photo = Photo.find(params[:id])

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("comment", "date_time", "photo_id", "user_id") VALUES (?, ?, ?, ?)  [["comment", "test1"], ["date_time", "2015-02-12 10:00:56.000000"], ["photo_id", 1], ["user_id", 1]]
---
    def create
        @comment = Comment.new(comment_params(params[:comment]))
        @comment.photo_id = params[:id]
        @comment.user_id = session["user"]
        @comment.date_time = Time.current
        @comment.photo = Photo.find(@comment.photo_id)

        if @comment.save()