project5/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
      @user_info = User.all

INSERT INTO "users" ("first_name", "last_name", "login", "password_digest", "salt") VALUES (?, ?, ?, ?, ?)  [["first_name", "first"], ["last_name", "last"], ["login", "user"], ["password_digest", "0f3e273efe67e947c3ff7d26ac58a8ad20375d3e"], ["salt", 0.1009109632894778]]
---
  def create
      @user = User.new(user_params(params[:user]))

#      @user.password_confirmation = params[:user][:password_confirmation]

      if @user.save()

SELECT  "users".* FROM "users"  WHERE "users"."login" = 'test' LIMIT 1
---
  def post_login

      user = User.find_by_login(params[:user_name])