project8/p1/app/controllers/photos_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def index
        if params[:id] and User.exists?(params[:id])
            @user = User.find(params[:id])

INSERT INTO "photos" ("date_time", "file_name", "user_id") VALUES (?, ?, ?)  [["date_time", "2015-02-12 23:21:50.236949"], ["file_name", "material_design_1.jpg"], ["user_id", 1]]
---
  	def create
  		puts "photo create---------"
  		@photo = Photo.new(photo_params(params[:photo]))
  		@photo.user_id = session[:user]
  		@photo.file_name = params[:photo][:file].original_filename
  		@photo.date_time = DateTime.now
  		if @photo.save()

SELECT "photos".* FROM "photos"
SELECT "comments".* FROM "comments"  WHERE "comments"."photo_id" = ?  [["photo_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
SELECT "tags".* FROM "tags"  WHERE "tags"."photo_id" = ?  [["photo_id", 6]]
---
    def search

        @result = []

        if (params[:search_text]==nil)||(params[:search_text]=="")
            render :json => @result.to_json;
            return
        end
        @text = params[:search_text].downcase
        Photo.all.each do |photo|


            searched = false
            photo.comments.each do |comment|
                if comment.comment.downcase.include? @text
                    @result[@result.length] = [photo.id , photo.user.id, "/assets/#{photo.file_name}"]
                    searched = true
                    break
                end
            end

            if searched!=true
                photo.tags.each do |tag|