project8/p1/app/controllers/tags_controller.rb

    def new
        if params[:id] and Photo.exists?(params[:id])
            @tag = Tag.new()
            @photo =  Photo.find(params[:id])
            @user_list = []
            User.all.each do |user|
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 6]]
SELECT "users".* FROM "users"

    def create
        @tag = Tag.new(tag_params(params[:tag]))
        puts "----------------------"
        puts @tag.attributes
        puts "----------------------"
        if @tag.save()
---
INSERT INTO "tags" ("height", "photo_id", "user_id", "width", "x_pos", "y_pos") VALUES (?, ?, ?, ?, ?, ?)  [["height", 133], ["photo_id", 12], ["user_id", 1], ["width", 144], ["x_pos", 150], ["y_pos", 139]]