project5/app/views/photos/index.html.erb

SELECT "photos".* FROM "photos"  WHERE "photos"."user_id" = ?  [["user_id", 1]]
---

	<% @user.photos.each do |photo| %>

SELECT "comments".* FROM "comments"  WHERE "comments"."photo_id" = ?  [["photo_id", 4]]
---

	        <% photo.comments.each do |comment| %>

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	                <a href="/photos/index/<%= comment.user.id %>">
	            		<%= comment.user.first_name+" "+comment.user.last_name%>